定义：
    门面模式 (facade) 又称外观模式、正面模式，这种模式用于将一组复杂的类包装到一个简单的外部接口中。
    GOF 在 《设计模式》 一书中给出如下定义：为子系统中的一组接口提供一个一致的界面
    Facade模式定义了一个高层接口，这个接口使得这一子系统更加容易使用

结构：
    门面模式有三个角色组成。
    1)、门面角色 (facade) ：这是门面模式的核心。他被客户角色调用，因此他熟悉子系统的功能。
                            它内部根据客户角色已有的需求预定了集中功能组合
    2)、子系统角色：实现了子系统的功能。对他而言，facade角色就和客户角色一样是未知的，他没有任何facade角色的信息和链接
    3)、客户角色：调用facade角色来完成要得到功能。

举例
    facade 模式的一个典型应用就是进行数据库连接，一般我们每一次对数据库进行访问，都需要进行一下操作：
        1)、先得到 connect 实例
        2)、打开 connect 获得连接，得到一个 statement
        3)、执行 sql 语句进行查询，得到查询结果集
    我们可以将这些步骤提取出来，封装在一个类里面。这样，每次执行数据库访问只需要将必要的参数传递到这个类中就可以了

使用环境
    1)、当你要为一个复杂子系统提供一个简单接口时。
    2)、客户程序与抽象类的实现部分之间存在着很大的依赖性。
        引入 facade 经这个子系统与客户以及其他子系统分离，可以提高子系统的独立性和可移植性
    3)、当你需要构建一个层次结构的子系统时，使用 facade 模式定义子系统中每层的入口点。
        如果子系统之间是相互依赖的，你可以让他们仅通过 facade
优点：
    1)、他对客户屏蔽子系统组件，因而减少了客户处理的对象的数目并使得子系统使用起来更加方便
    2)、实现了子系统与客户之间的松耦合关系，而子系统内部的功能组件往往是紧耦合的。
        松耦合关系使得子系统的组件变化不会影响到它的用户。
        Facade 模式 有助于建立层次结构系统，也有助于对对象之间依赖关系分层。
        Facade 模式可以消除复杂的循环依赖关系。这一点在客户程序与子系统时分别实现的时候尤为重要。
        在大型软件系统中降低编译依赖性至关重要。
        在子系统改变时，希望尽量减少重编译工作节省时间。
        用 Facade 可以降低编译的依赖性，限制重要系统中较小的变化所需要的重编译工作。
        Facade 模式同样也有利于简化系统在不同平台之间的移植过程，因为编译一个子系统一般不需要编译所有其他的子系统。
    3)、如果应用有需要，它并不限制他们使用子系统类。因此你可以让客户程序在系统易用性和通用性之间加以选择。

总结
    从整体上来看门面模式给我的感觉是，它对于使两层之间的调用粗颗粒化很有帮助，
    避免了大量细颗粒度的访问。这和 SOA 中的一些观点是相同的。